In [9]:
#Dependencies
import pandas as pd
import numpy as np

In [10]:
#Import CSV File
nr_2015_sta_path = "Input_Data/Nice_Ride_2015_station_locations.csv"
nr_2015_trip_path = "Input_Data/Nice_ride_trip_history_2015_season.csv"

In [11]:
#Read station data to df
station_15 = pd.read_csv(nr_2015_sta_path, dtype={"Terminal":int, "Station":str, "Latitude":float, "Longitude":float, "NbDocks":int, "Notes":str})
station_15.head()

,Terminal,Station,Latitude,Longitude,NbDocks,Notes
0,30000,100 Main Street SE,44.984892,-93.256551,27,NaN
1,30001,25th Street & 33rd Ave S,44.957341,-93.223374,15,NaN
2,30002,Riverside Ave & 23rd Ave S,44.967115,-93.240149,15,NaN
3,30003,Plymouth Ave N & N Oliver Ave,44.991412,-93.306269,15,NaN
4,30004,11th Street & Hennepin,44.975340,-93.278690,23,NaN

In [12]:
# Get number of stations
len(station_15)

190

In [13]:
# Remove unused columns
station_15 = station_15.drop(columns=["NbDocks", "Notes"])
station_15

     Terminal                         Station   Latitude  Longitude
0       30000              100 Main Street SE  44.984892 -93.256551
1       30001        25th Street & 33rd Ave S  44.957341 -93.223374
2       30002      Riverside Ave & 23rd Ave S  44.967115 -93.240149
3       30003  Plymouth Ave N &  N Oliver Ave  44.991412 -93.306269
4       30004          11th Street & Hennepin  44.975340 -93.278690
..        ...                             ...        ...        ...
185     30185      5th Street NE & 3rd Ave NE  44.991821 -93.255558
186     30186      5th Street & Nicollet Mall  44.978665 -93.270503
187     30187   Groveland Ave & Clifton Place  44.966145 -93.286294
188     30188          8th Street & 2nd Ave S  44.974795 -93.270649
189     30189    Delaware St SE & 26th Ave SE  44.972128 -93.221021

[190 rows x 4 columns]

In [14]:
# Rename columns to create a universal format
station_15.rename(columns={"Terminal" : "station_id", 
                           "Station" : "station_name", 
                           "Latitude" : "station_lat", 
                           "Longitude" : "station_lng"}, 
                  inplace=True)

In [15]:
station_15.head()

   station_id                    station_name  station_lat  station_lng
0       30000              100 Main Street SE    44.984892   -93.256551
1       30001        25th Street & 33rd Ave S    44.957341   -93.223374
2       30002      Riverside Ave & 23rd Ave S    44.967115   -93.240149
3       30003  Plymouth Ave N &  N Oliver Ave    44.991412   -93.306269
4       30004          11th Street & Hennepin    44.975340   -93.278690

In [16]:
# Export .csv
station_15.to_csv(path_or_buf="Resources/Nice_ride_2015_station_locations.csv", index=False)

In [17]:
# Read trip data to df
trip_15 = pd.read_csv(nr_2015_trip_path, dtype={"Start date":str, "Start station":str, "Start station number":str, "End date":str, "End station":str, "End station number":str, "Total duration (Seconds)":int, "Account type":str})
trip_15.head()

,Start date,Start station,Start station number,End date,End station,End station number,Total duration (Seconds),Account type
0,11/1/2015 21:55,West 15th Street & Willow,30093,11/1/2015 22:12,Nicollet Island,30170,983,Member
1,11/1/2015 21:55,West 15th Street & Willow,30093,11/1/2015 22:12,Nicollet Island,30170,980,Member
2,11/1/2015 21:55,4th Street & 13th Ave SE,30009,11/1/2015 22:05,Logan Park,30104,565,Casual
3,11/1/2015 21:54,Lyndale Ave S & 22nd Street,30017,11/1/2015 21:55,Lyndale Ave S & 22nd Street,30017,65,Member
4,11/1/2015 21:54,YWCA Downtown,30006,11/1/2015 22:44,YWCA Downtown,30006,3037,Casual

In [18]:
len(trip_15)

483229

In [ ]:
trip_15["Start date"] = pd.to_datetime(trip_15["Start date"])
trip_15["End date"] = pd.to_datetime(trip_15["End date"])

In [ ]:
trip_15.rename(columns={"Start date" : "start_datetime", 
                        "Start station" : "start_station_name", 
                        "Start station number" : "start_station_id",
                        "End date" : "end_datetime",
                        "End station" : "end_station_name",
                        "End station number" : "end_station_id",
                        "Total duration (Seconds)" : "total_duration_sec",
                        "Account type" : "account_type"}, 
              inplace=True)

In [ ]:
trip_15.head()

In [ ]:
# Re-sort by datetime
trip_15 = trip_15.sort_values(["start_datetime"], ignore_index=True)
trip_15

In [ ]:
# Export .csv
trip_15.to_csv(path_or_buf="Resources/Nice_ride_trip_history_2015_season.csv", index=False)